FKDD_COPY_DIFF_3_2026-02-13/Catalogs/ПодразделенияКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПодразделенияКомпании</Name>
			<Comment>Подразделения компании</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация, к которой относится подразделение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Comment>Префикс автонумерации для документов (до 3-х букв)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Comment>Код причины постановки на учет</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Comment>График работы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановкаЦенДокументамиПоступления</Name>
					<Comment>Установка цен документами поступления</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьЗакупочнуюЦену</Name>
					<Comment>Формировать закупочную цену</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьНормативнуюЦену</Name>
					<Comment>Формировать нормативную цену</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереоценкаРозницаПоПриходу</Name>
					<Comment>Переоценивать розничные остатки при оприходовании товаров</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереоценкаРозницаПоРасходу</Name>
					<Comment>Переоценивать розничные остатки при списании товаров</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Балансовое</Name>
					<Comment>Признак того, что подразделение является балансовым</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Основная валюта подразделения. Подставляется по умолчанию в новые документы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Comment>Основной банковский счет организации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаТД</Name>
					<Comment>Ответственный за тест-драйв</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНалога</Name>
					<Comment>Вид налога</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсвобожденОтНДС</Name>
					<Comment>Если флажок установлен, то при заполнении приходных документов от этого подразделения, товары будут поступать без НДС</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>тт_НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.тт_НаправлениеДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БТ_НазваниеДляССП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БТ_ПодразделениеКМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БТ_ПодразделенияКМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БТ_ВключитьРезервированиеПоЗаявкеНаРемонт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БТ_ПодразделениеССП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БТ_ПодразделенияССП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Catalogs/ПодразделенияКомпании/Ext/ManagerModule.bsl
// процедура заполнения предопределенных элементов справочника
//
// Параметры:
// ЗаполнятьВсе - Булево - Признак заполнение всей информации
//
Процедура ЗаполнитьПредопределенныеЭлементы(ЗаполнятьВсе=Ложь) Экспорт
	ПодразделенияКомпанииОсновноеПодразделение = Справочники.ПодразделенияКомпании.ОсновноеПодразделение.ПолучитьОбъект();
	//перезаполняем реквизиты
	Если ЗаполнятьВсе Тогда
		ПодразделенияКомпанииОсновноеПодразделение.Организация = Справочники.Организации.ОсновнаяОрганизация;
	ИначеЕсли обЗначениеНеЗаполнено(ПодразделенияКомпанииОсновноеПодразделение.Организация) Тогда
		ПодразделенияКомпанииОсновноеПодразделение.Организация = Справочники.Организации.ОсновнаяОрганизация;
	КонецЕсли;
	
	//Сохранение справочника
	НовыйЭлемент = ПодразделенияКомпанииОсновноеПодразделение.ЭтоНовый();
	Если ПодразделенияКомпанииОсновноеПодразделение.Модифицированность() Тогда
		Попытка		
			ПодразделенияКомпанииОсновноеПодразделение.Записать();
			Сообщить("Справочник ""Подразделения компании"". "+?(НовыйЭлемент,"Создан","Модифицирован")+" элемент """+СокрЛП(ПодразделенияКомпанииОсновноеПодразделение.Наименование)+"""");
		Исключение
		КонецПопытки;
	КонецЕсли;
		
	// На нулевом уровне может находится только предопределенный элемент "Вся компания". 
	// Поэтому все лишнее перенесем на первый уровень.
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПодразделенияКомпании.Ссылка
	|ИЗ
	|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
	|ГДЕ
	|	ПодразделенияКомпании.Родитель = &Родитель
	|	И ПодразделенияКомпании.Ссылка <> &Ссылка";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Родитель", Справочники.ПодразделенияКомпании.ПустаяСсылка());
	Запрос.УстановитьПараметр("Ссылка",   Справочники.ПодразделенияКомпании.ОсновноеПодразделение);
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл // Все элементы на этом уровне "Лишние".
		ТекОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ТекОбъект.Родитель = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
		ТекОбъект.Записать();
	КонецЦикла;  	
	
	// Подразделение "Вся компания" (корневой элемент) всегда будет балансовым.
	// SUIG - на необходимость записи как бы тоже надо проверять (а то так и будет по обменам ходить...)
	ПодразделенияКомпанииОсновноеПодразделение = Справочники.ПодразделенияКомпании.ОсновноеПодразделение.ПолучитьОбъект();
	Если НЕ ПодразделенияКомпанииОсновноеПодразделение.Балансовое  Тогда
		ПодразделенияКомпанииОсновноеПодразделение.Балансовое = Истина;
		ПодразделенияКомпанииОсновноеПодразделение.Записать();
	КонецЕсли; 
	
	ПодразделенияКомпанииОсновноеПодразделение = Неопределено;
КонецПроцедуры // ЗаполнитьПредопределенныеЭлементы()

Функция ПолучитьСписокПодразделенийССП() Экспорт
	
	СписокПодразеделений = новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПодразделенияКомпании.БТ_НазваниеДляССП КАК БТ_НазваниеДляССП
		|ИЗ
		|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
		|ГДЕ
		|	НЕ ПодразделенияКомпании.БТ_НазваниеДляССП = """"";
	
	СписокПодразеделений.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("БТ_НазваниеДляССП"));
	
	Возврат СписокПодразеделений;
	
КонецФункции
